# PhyMaterialParamShearReinforcement Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..PhyMaterialParamShearReinforcement Property
ParameterTypeId Class See Also
---
"Shear reinforcement yield stress"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId PhyMaterialParamShearReinforcement { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property PhyMaterialParamShearReinforcement As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ PhyMaterialParamShearReinforcement {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace